lib/tasks/import_stations.rake

    def import_station(item)
        station = Station.new({
            identifier: item["identifier"],
            name: item["name"],
            address: item["address"]})

        if station.save
---
INSERT INTO `stations` (`identifier`, `name`, `address`, `created_at`, `updated_at`) VALUES (21, 'Florence Bank Station', '19 Meadow Street Florence MA @ Lilly Library', '2023-04-28 01:11:28.374515', '2023-04-28 01:11:28.374515')