lib/tasks/import_bikes.rake

SELECT `stations`.* FROM `stations` WHERE `stations`.`identifier` = 25 LIMIT 1
---
    task :data => :environment do

        bikes_data = File.join Rails.root, "notes/bike-data.csv"
        CSV.foreach(bikes_data, headers: true) do |row|
            b = Bike.new
            b.identifier = row["identifier"]
            b.current_station = Station.find_by(identifier: row["current_station_identifier"])