app/views/address/edit.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
<%= form_with model: Current.user, url: edit_address_path do |form| %>
    <% if Current.user.errors.any? %>