app/controllers/rentals_controller.rb

SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` = 3740 LIMIT 1
---
    def new
      @bike= Bike.find_by_identifier(params[:format])

INSERT INTO `rental` (`hours`, `price`, `created_at`, `updated_at`) VALUES (4, NULL, '2023-04-25 19:18:43.594632', '2023-04-25 19:18:43.594632')
SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` = 3740 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2023-04-25 19:18:43.586653', `users`.`wallet_point` = 234 WHERE `users`.`id` = 5
UPDATE `bikes` SET `bikes`.`current_station_id` = 7, `bikes`.`updated_at` = '2023-05-02 01:02:01.566226' WHERE `bikes`.`id` = 2
---
    def create
      @rental = Rental.new(rental_params)
      @price = @rental.hours*10
      if @price > Current.user.wallet_point
        redirect_to change_wallet_path, notice:"Not enough money point in your Wallet"
      end

      puts @rental
      if @rental.save
        @bikes= Bike.find_by_identifier(params[:format])
        $s= @bikes.current_station_id
        @bikes.update({current_station_id: nil })
        Current.user.wallet_point-=@price
        Current.user.save
        puts @rental
        if @rental.save
          @bikes= Bike.find_by_identifier(params[:format])
          $s= @bikes.current_station_id
          @bikes.update({current_station_id: nil })

SELECT `bikes`.* FROM `bikes` WHERE `bikes`.`identifier` IS NULL LIMIT 1
UPDATE `bikes` SET `bikes`.`current_station_id` = 7, `bikes`.`updated_at` = '2023-05-02 01:02:01.566226' WHERE `bikes`.`id` = 2
---
    def return
      @bikes= Bike.find_by_identifier(params[:format])
      @bikes.update({current_station_id: $s })