app/controllers/wallet_controller.rb

UPDATE `users` SET `users`.`updated_at` = '2023-04-25 20:50:47.705495', `users`.`wallet_point` = 262 WHERE `users`.`id` = 5
UPDATE `users` SET `users`.`wallet_point` = 10, `users`.`updated_at` = '2023-05-01 23:04:18.238828' WHERE `users`.`id` = 1
UPDATE `users` SET `users`.`wallet_point` = 11, `users`.`updated_at` = '2023-05-01 23:34:54.639142' WHERE `users`.`id` = 1
---
    def update

        if params[:finamecard] == "Bikesia" && params[:lanamecard] =="Team" && params[:card_num] == "1111111111" && params[:card_date] == "2023-02-01" && params[:cvv] == "111"
            Current.user.wallet_point+=params[:wallet_add_card].to_i
            Current.user.save
            redirect_to user_home_path, notice: "Added through credit card"
        elsif params[:email_paypal] =="test@smith.edu" && params[:password_paypal] =="password"
            Current.user.wallet_point+=params[:wallet_add_paypal].to_i
            puts params[:wallet_add_paypal].to_i
            Current.user.save
            redirect_to user_home_path, notice: "Added through paypal"
        elsif params[:coupon_number] == "CYBER" && params[:coupon_sc] =="2023"
            Current.user.wallet_point+=10
            Current.user.save